//---------------------------------------------------------------------------

#include <vcl.h>
#pragma hdrstop

#include "Unit1.h"
//---------------------------------------------------------------------------
#pragma package(smart_init)
#pragma resource "*.dfm"
TForm1 *Form1;

//**************************************************
//【イベント処理】
//**************************************************
//---------------------------------------------------------------------------
/**
 * フォームロード
 */
__fastcall TForm1::TForm1(TComponent* Owner)
	: TForm(Owner)
{
	// メソッド内変数宣言
}
//---------------------------------------------------------------------------
/**
 * 閉じるボタン押下
 * @param TObject *Sender 呼び出し元オブジェクト
 * @return void
 */
void __fastcall TForm1::btn_EndClick(TObject *Sender)
{
	// メソッド内変数宣言

	try
	{
		//
	}
	catch (int e)
	{
		//
	}
}
//---------------------------------------------------------------------------
/**
 * CSV出力ボタン押下
 * @param TObject *Sender 呼び出し元オブジェクト
 * @return void
 */
void __fastcall TForm1::btn_CsvOutputClick(TObject *Sender)
{
	// メソッド内変数宣言

	try
	{
		//
	}
	catch (int e)
	{
		//
	}
}
//---------------------------------------------------------------------------
 /**
 * プレビューボタン押下
 * @param TObject *Sender 呼び出し元オブジェクト
 * @return void
 */
void __fastcall TForm1::btn_PreviewClick(TObject *Sender)
{
	// メソッド内変数宣言

	try
	{
		//
	}
	catch (int e)
	{
		//
	}
}
//---------------------------------------------------------------------------

//**************************************************
//【ユーザー定義関数】
//**************************************************
/**
 * CSV出力処理
 */
void __fastcall TForm1::CsvOutput()
{
	// メソッド内変数宣言

	try
	{
        //**************************************************
		//【】
		//**************************************************
    }
	catch (int e)
	{
		throw e;
	}
}
//---------------------------------------------------------------------------
/**
 * プレビュー処理
 */
void __fastcall TForm1::Preview()
{
	// メソッド内変数宣言

	try
	{
        //**************************************************
		//【】
		//**************************************************
    }
	catch (int e)
	{
		throw e;
	}
}
//---------------------------------------------------------------------------

